package com.yx.sys.common;


/**
 * 站内信模板枚举
 * 包含系统所有站内信
 * @since TangHuaLiang
 */
public enum UserMessageTemplateEnum {
    MESSAGE_1(1,"借款初审","[%1$s先生/女士]，您在******发布的第[%2$s]号借款已经通过初审。"),
    MESSAGE_2(2,"借款复审","[%1$s先生/女士]，您在******发布的第[%2$s]号借款已经通过复审。"),

    MESSAGE_3(3,"出借成功","[%1$s先生/女士]，您在******投标[%2$s]元已经成功，期限[%3$s]，预期收益[%4$s]元"),
    MESSAGE_4(4,"出借失败","[%1$s先生/女士]，您好，您在******出借[%2$s]元失败了。"),
    MESSAGE_5(5,"借款还款","[%1$s先生/女士]，您好，您在******于[%2$s]日有应还款，本金[%3$s]元，利息[%4$s]元，总额[%5$s]元，请提前准备好款项。"),
    MESSAGE_6(6,"回款","[%1$s先生/女士]，您好，您在******有新的回款，本金[%2$s]元，利息[%3$s]元。"),

    MESSAGE_7(7,"提现申请成功","[%1$s先生/女士]，您在******提现的[%2$s]元已经受理成功。"),
    MESSAGE_8(8,"提现申请失败","[%1$s先生/女士]，您在******提现的[%2$s]元失败了。"),
    MESSAGE_9(9,"在线充值成功","[%1$s先生/女士]，您好，您在******通过线下充值的[%2$s]元已到帐。"),
    MESSAGE_10(10,"在线充值失败","[%1$s先生/女士]，您好，您在******通过线上充值的资金[%2$s]元未成功到账，建议重新操作，若绑定银行卡已扣款，请耐心等待。"),
    MESSAGE_11(11,"借款计息","[%1$s先生/女士]，您在******出借的第[%2$s]号借款已经满标，现在开始计息。"),
    MESSAGE_12(12,"借款流标","[%1$s先生/女士]，您在******出借的第[%2$s]号借款已流标。"),
    MESSAGE_13(13,"还款到账","[%1$s先生/女士]，您在******出借的第[%2$s]号标第[%3$s]期的还款已到帐。"),

    MESSAGE_19(19, "加息回款", "[%1$s先生/女士]，您好，您在******出借的第[%2$s]号标，第[%3$s]期加息收益已到账。"),

    MESSAGE_20(20, "卡券到期提醒", "[%1$s先生/女士]，您好，您在******的[%2$s]即将到期，请于[%3$s]前使用。"),

    MESSAGE_21(21, "加息券发放", "[%1$s先生/女士]，您好，您在******获得[%2$s]，已经发送到您的账户，请及时查看。"),
    MESSAGE_22(22, "现金券发放", "[%1$s先生/女士]，您好，您在******获得[%2$s]，已经发送到您的账户，请及时查看。"),
    MESSAGE_23(23, "红包发放", "[%1$s先生/女士]，您好，您在******获得[%2$s]，已经发送到您的账户，请及时领取。"),

    MESSAGE_24(24, "加息券使用", "[%1$s先生/女士]，您好，您在******的[%2$s]，已使用成功。"),
    MESSAGE_25(25, "现金券使用", "[%1$s先生/女士]，您好，您在******的[%2$s]，已使用成功。"),

    MESSAGE_26(26, "加息券回款", "[%1$s先生/女士]，您好，您在******出借的第[%2$s]号标，使用的[%3$s]，第[%4$s]期加息收益已到账。"),
    MESSAGE_27(27, "现金券回款", "[%1$s先生/女士]，您好，您在******出借的第[%2$s]号标，使用的[%3$s]已到账。"),

    MESSAGE_28(28, "红包领取成功", "[%1$s先生/女士]，您好，您在******领取的[%2$s]已到账。"),
    MESSAGE_29(29, "红包领取失败", "[%1$s先生/女士]，您好，您在******领取的[%2$s]失败，建议重新操作。"),


    MESSAGE_30(30, "加入智投", "[%1$s先生/女士]，您已成功加入******[%2$s]计划，加入金额[%3$s]元，共[%4$s]期，项目将于满标放款后产生收益，请注意查看收益详情。"),
    MESSAGE_31(31, "智投加息券回款", "[%1$s先生/女士]，您已加入******[%2$s]计划，加入金额[%3$s]元，使用[%4$s]的加息券，本期加息券收益[%5$s]元，已返回到您的存管账户，请注意查收，祝生活愉快！"),
    MESSAGE_32(32, "智投利息回款", "[%1$s先生/女士]，您加入******[%2$s]计划有新的回款，回款本金[%3$s]元，回款收益[%4$s]元，已返回到您的存管账户，请注意查收，祝生活愉快！"),
    MESSAGE_33(33, "智投息差返还", "[%1$s先生/女士]，您已加入******[%2$s]计划，加入金额[%3$s]元，产生的利差金额[%4$s]元，已返回到您的存管账户，请注意查收，祝生活愉快！"),
    MESSAGE_34(34, "智投流标提醒", "[%1$s先生/女士]，您加入******[%2$s]计划，加入金额[%3$s]元，有[%4$s]元加入资金已流标，资金已经回退到您的个人账户中，建议您稍后查询，造成的不便望您谅解，如有疑问请您致电客服热线400-051-6868。"),

    ;

    /**
     * 成员变量
     */
    private int id;//状态值id
    private String title;//标题
    private String content;//内容

    public int getId() {
        return id;
    }
    public String getTitle() {
        return title;
    }
    public String getContent() {
        return content;
    }



    /**
     * 构造方法
     * @param id
     * @param title
     * @param content
     */
    private UserMessageTemplateEnum(int id, String title,String content) {
        this.id=id;
        this.title=title;
        this.content=content;
    }

    public static UserMessageTemplateEnum resolve(int id) {
        for(UserMessageTemplateEnum demo: UserMessageTemplateEnum.values()) {
            if(demo.getId()==id) {
                return demo;
            }
        }
        return null;
    }


}
